wzurawski015/esp8266-event-driven-framework/adapters/esp8266_rtos_sdk/components/ev_platform/ev_i2c_adapter.c
static void ev_esp8266_i2c_note_ack_phase(ev_esp8266_i2c_adapter_ctx_t *ctx,
                                           ev_esp8266_i2c_phase_t phase,
                                           ev_i2c_status_t status)
{
    if (ctx == NULL) {
        return;
    }

    ev_esp8266_i2c_set_phase(ctx, phase);
    switch (phase) {
    case EV_ESP8266_I2C_PHASE_ADDR_W:
        if (status == EV_I2C_OK) {
            ++ctx->address_write_acks;
        } else if (status == EV_I2C_ERR_NACK) {
            ++ctx->address_write_nacks;
        }
        break;
    case EV_ESP8266_I2C_PHASE_ADDR_R:
        if (status == EV_I2C_OK) {
            ++ctx->address_read_acks;
        } else if (status == EV_I2C_ERR_NACK) {
            ++ctx->address_read_nacks;
        }
        break;
    case EV_ESP8266_I2C_PHASE_REG:
    case EV_ESP8266_I2C_PHASE_DATA_W:
        if (status == EV_I2C_OK) {
            ++ctx->data_write_acks;
        } else if (status == EV_I2C_ERR_NACK) {
            ++ctx->data_write_nacks;
        }
        break;
    default:
        break;
    }
}

static ev_i2c_status_t ev_esp8266_i2c_record_status(ev_esp8266_i2c_adapter_ctx_t *ctx, ev_i2c_status_t status)
{
    if (ctx != NULL) {
        ctx->last_status = status;
    }
    if ((ctx != NULL) && (status != EV_I2C_OK)) {
        ++ctx->transactions_failed;
        switch (status) {
        case EV_I2C_ERR_TIMEOUT:
            ++ctx->timeouts;
            break;
        case EV_I2C_ERR_NACK:
            ++ctx->nacks;
            break;
        case EV_I2C_ERR_BUS_LOCKED:
        default:
            ++ctx->bus_locked;
            break;
        }
    }

    return status;
}

static void ev_esp8266_i2c_release_sda(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    gpio_set_level((gpio_num_t)ctx->sda_pin, 1);
}

static void ev_esp8266_i2c_release_scl(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    gpio_set_level((gpio_num_t)ctx->scl_pin, 1);
}

static void ev_esp8266_i2c_drive_sda_low(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    gpio_set_level((gpio_num_t)ctx->sda_pin, 0);
}

static void ev_esp8266_i2c_drive_scl_low(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    gpio_set_level((gpio_num_t)ctx->scl_pin, 0);
}

static bool ev_esp8266_i2c_sample_sda(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    return gpio_get_level((gpio_num_t)ctx->sda_pin) != 0;
}

static bool ev_esp8266_i2c_sample_scl(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    return gpio_get_level((gpio_num_t)ctx->scl_pin) != 0;
}

static bool ev_esp8266_i2c_deadline_expired(int64_t started_us)
{
    return (esp_timer_get_time() - started_us) >= EV_ESP8266_I2C_TRANSACTION_TIMEOUT_US;
}

static ev_i2c_status_t ev_esp8266_i2c_wait_scl_high(const ev_esp8266_i2c_adapter_ctx_t *ctx, int64_t started_us)
{
    uint32_t waited_us = 0U;

    while (!ev_esp8266_i2c_sample_scl(ctx)) {
        if (ev_esp8266_i2c_deadline_expired(started_us) ||
            (waited_us >= EV_ESP8266_I2C_CLOCK_STRETCH_TIMEOUT_US)) {
            return EV_I2C_ERR_TIMEOUT;
        }

        ets_delay_us(1U);
        ++waited_us;
    }

    return EV_I2C_OK;
}

static ev_i2c_status_t ev_esp8266_i2c_raise_scl(const ev_esp8266_i2c_adapter_ctx_t *ctx, int64_t started_us)
{
    ev_i2c_status_t status;

    if (ev_esp8266_i2c_deadline_expired(started_us)) {
        return EV_I2C_ERR_TIMEOUT;
    }

    ev_esp8266_i2c_release_scl(ctx);
    status = ev_esp8266_i2c_wait_scl_high(ctx, started_us);
    if (status != EV_I2C_OK) {
        return status;
    }

    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);
    return EV_I2C_OK;
}

static void ev_esp8266_i2c_lower_scl(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    ev_esp8266_i2c_drive_scl_low(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);
}

static void ev_esp8266_i2c_release_bus_lines(const ev_esp8266_i2c_adapter_ctx_t *ctx)
{
    ev_esp8266_i2c_release_sda(ctx);
    ev_esp8266_i2c_release_scl(ctx);
}

static ev_i2c_status_t ev_esp8266_i2c_recover_bus(ev_esp8266_i2c_adapter_ctx_t *ctx, int64_t started_us)
{
    uint8_t pulse;

    if (ctx == NULL) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    ++ctx->bus_recoveries;

    ev_esp8266_i2c_release_sda(ctx);
    ev_esp8266_i2c_release_scl(ctx);

    for (pulse = 0U; pulse < EV_ESP8266_I2C_RECOVERY_PULSES; ++pulse) {
        ev_i2c_status_t status;

        status = ev_esp8266_i2c_raise_scl(ctx, started_us);
        if (status != EV_I2C_OK) {
            ++ctx->bus_recovery_failures;
            return status;
        }

        if (ev_esp8266_i2c_sample_sda(ctx)) {
            break;
        }

        ev_esp8266_i2c_lower_scl(ctx);
    }

    ev_esp8266_i2c_drive_sda_low(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);

    {
        ev_i2c_status_t status = ev_esp8266_i2c_raise_scl(ctx, started_us);
        if (status != EV_I2C_OK) {
            ev_esp8266_i2c_release_bus_lines(ctx);
            ++ctx->bus_recovery_failures;
            return status;
        }
    }

    ev_esp8266_i2c_release_sda(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);

    if (!ev_esp8266_i2c_sample_sda(ctx) || !ev_esp8266_i2c_sample_scl(ctx)) {
        ++ctx->bus_recovery_failures;
        return EV_I2C_ERR_BUS_LOCKED;
    }

    return EV_I2C_OK;
}

static ev_i2c_status_t ev_esp8266_i2c_prepare_bus(ev_esp8266_i2c_adapter_ctx_t *ctx, int64_t started_us)
{
    ev_i2c_status_t status;

    ev_esp8266_i2c_release_bus_lines(ctx);
    status = ev_esp8266_i2c_wait_scl_high(ctx, started_us);
    if (status != EV_I2C_OK) {
        return status;
    }

    if (ev_esp8266_i2c_sample_sda(ctx)) {
        return EV_I2C_OK;
    }

    return ev_esp8266_i2c_recover_bus(ctx, started_us);
}

static ev_i2c_status_t ev_esp8266_i2c_start_condition(ev_esp8266_i2c_adapter_ctx_t *ctx, int64_t started_us)
{
    ev_i2c_status_t status;

    ev_esp8266_i2c_release_sda(ctx);
    ev_esp8266_i2c_release_scl(ctx);

    status = ev_esp8266_i2c_wait_scl_high(ctx, started_us);
    if (status != EV_I2C_OK) {
        return status;
    }

    if (!ev_esp8266_i2c_sample_sda(ctx)) {
        status = ev_esp8266_i2c_recover_bus(ctx, started_us);
        if (status != EV_I2C_OK) {
            return status;
        }
    }

