wzurawski015/esp8266-event-driven-framework/adapters/esp8266_rtos_sdk/components/ev_platform/ev_i2c_adapter.c
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);
    ev_esp8266_i2c_drive_sda_low(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);
    ev_esp8266_i2c_drive_scl_low(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);

    return EV_I2C_OK;
}

static ev_i2c_status_t ev_esp8266_i2c_stop_condition(ev_esp8266_i2c_adapter_ctx_t *ctx, int64_t started_us)
{
    ev_i2c_status_t status;
    bool sda_high;
    bool scl_high;

    ev_esp8266_i2c_set_phase(ctx, EV_ESP8266_I2C_PHASE_STOP);
    ++ctx->stop_attempted;

    ev_esp8266_i2c_drive_sda_low(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);

    status = ev_esp8266_i2c_raise_scl(ctx, started_us);
    if (status != EV_I2C_OK) {
        ev_esp8266_i2c_release_bus_lines(ctx);
        ++ctx->stop_release_fail;
        ++ctx->bus_idle_after_stop_fail;
        ctx->last_sda_high_after_stop = ev_esp8266_i2c_sample_sda(ctx);
        ctx->last_scl_high_after_stop = ev_esp8266_i2c_sample_scl(ctx);
        ev_esp8266_i2c_set_phase(ctx, EV_ESP8266_I2C_PHASE_RELEASE);
        return status;
    }

    ev_esp8266_i2c_release_sda(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);

    sda_high = ev_esp8266_i2c_sample_sda(ctx);
    scl_high = ev_esp8266_i2c_sample_scl(ctx);
    ctx->last_sda_high_after_stop = sda_high;
    ctx->last_scl_high_after_stop = scl_high;
    ev_esp8266_i2c_set_phase(ctx, EV_ESP8266_I2C_PHASE_RELEASE);

    if (!sda_high || !scl_high) {
        ++ctx->stop_release_fail;
        ++ctx->bus_idle_after_stop_fail;
        return EV_I2C_ERR_BUS_LOCKED;
    }

    ++ctx->stop_ok;
    ++ctx->bus_idle_after_stop_ok;
    return EV_I2C_OK;
}

static ev_i2c_status_t ev_esp8266_i2c_write_byte(const ev_esp8266_i2c_adapter_ctx_t *ctx,
                                                  uint8_t value,
                                                  int64_t started_us)
{
    uint8_t bit_index;

    for (bit_index = 0U; bit_index < 8U; ++bit_index) {
        ev_i2c_status_t status;

        if ((value & 0x80U) != 0U) {
            ev_esp8266_i2c_release_sda(ctx);
        } else {
            ev_esp8266_i2c_drive_sda_low(ctx);
        }

        status = ev_esp8266_i2c_raise_scl(ctx, started_us);
        if (status != EV_I2C_OK) {
            ev_esp8266_i2c_release_sda(ctx);
            return status;
        }

        ev_esp8266_i2c_lower_scl(ctx);
        value = (uint8_t)(value << 1U);
    }

    ev_esp8266_i2c_release_sda(ctx);

    {
        ev_i2c_status_t status = ev_esp8266_i2c_raise_scl(ctx, started_us);
        bool acked;

        if (status != EV_I2C_OK) {
            return status;
        }

        acked = !ev_esp8266_i2c_sample_sda(ctx);
        ev_esp8266_i2c_lower_scl(ctx);

        return acked ? EV_I2C_OK : EV_I2C_ERR_NACK;
    }
}

static ev_i2c_status_t ev_esp8266_i2c_write_byte_observed(ev_esp8266_i2c_adapter_ctx_t *ctx,
                                                           uint8_t value,
                                                           int64_t started_us,
                                                           ev_esp8266_i2c_phase_t phase)
{
    ev_i2c_status_t status = ev_esp8266_i2c_write_byte(ctx, value, started_us);
    ev_esp8266_i2c_note_ack_phase(ctx, phase, status);
    return status;
}

static ev_i2c_status_t ev_esp8266_i2c_read_byte(ev_esp8266_i2c_adapter_ctx_t *ctx,
                                                 uint8_t *out_value,
                                                 bool ack_after_byte,
                                                 int64_t started_us)
{
    uint8_t value = 0U;
    uint8_t bit_index;

    ev_esp8266_i2c_release_sda(ctx);

    for (bit_index = 0U; bit_index < 8U; ++bit_index) {
        ev_i2c_status_t status = ev_esp8266_i2c_raise_scl(ctx, started_us);
        if (status != EV_I2C_OK) {
            return status;
        }

        value = (uint8_t)(value << 1U);
        if (ev_esp8266_i2c_sample_sda(ctx)) {
            value = (uint8_t)(value | 0x01U);
        }

        ev_esp8266_i2c_lower_scl(ctx);
    }

    if (ack_after_byte) {
        ev_esp8266_i2c_drive_sda_low(ctx);
    } else {
        ev_esp8266_i2c_release_sda(ctx);
    }

    {
        ev_i2c_status_t status = ev_esp8266_i2c_raise_scl(ctx, started_us);
        if (status != EV_I2C_OK) {
            ev_esp8266_i2c_release_sda(ctx);
            return status;
        }
    }

    ev_esp8266_i2c_lower_scl(ctx);
    ev_esp8266_i2c_release_sda(ctx);

    ++ctx->read_bytes;
    if (ack_after_byte) {
        ev_esp8266_i2c_set_phase(ctx, EV_ESP8266_I2C_PHASE_DATA_R);
    } else {
        ++ctx->read_final_nack_sent;
        ev_esp8266_i2c_set_phase(ctx, EV_ESP8266_I2C_PHASE_FINAL_NACK);
    }

    *out_value = value;
    return EV_I2C_OK;
}

static ev_i2c_status_t ev_esp8266_i2c_write_payload(ev_esp8266_i2c_adapter_ctx_t *ctx,
                                                     const uint8_t *data,
                                                     size_t data_len,
                                                     int64_t started_us)
{
    size_t offset;

    for (offset = 0U; offset < data_len; ++offset) {
        ev_i2c_status_t status = ev_esp8266_i2c_write_byte_observed(ctx, data[offset], started_us, EV_ESP8266_I2C_PHASE_DATA_W);
        if (status != EV_I2C_OK) {
            return status;
        }
    }

    return EV_I2C_OK;
}

/*
 * Shared-bus timing policy:
 * - transaction timeout must tolerate one bounded OLED page-chunk transfer,
 * - mutex timeout must be longer than one command budget so slower bulk OLED
 *   flushes do not starve MCP23008/RTC access behind a too-aggressive bus lock
 *   window,
 * - runtime transactions never allocate heap memory,
 * - MISRA/Power-of-Ten exception: the ESP8266 RTOS SDK configuration does not
 *   provide supported static semaphore creation.  xSemaphoreCreateMutex() is
 *   therefore permitted here only during boot-time hardware initialization; no
 *   runtime I2C transaction allocates heap memory.
 */
static ev_i2c_status_t ev_esp8266_i2c_take_bus_with_timeout(TickType_t timeout_ticks)
{
    if (g_ev_i2c_bus_mutex == NULL) {
        return EV_I2C_ERR_BUS_LOCKED;
    }

    if (xSemaphoreTake(g_ev_i2c_bus_mutex, timeout_ticks) != pdTRUE) {
        return EV_I2C_ERR_TIMEOUT;
    }

    return EV_I2C_OK;
}

static ev_i2c_status_t ev_esp8266_i2c_take_bus(void)
{
    return ev_esp8266_i2c_take_bus_with_timeout(EV_ESP8266_I2C_MUTEX_TIMEOUT_TICKS);
}

static void ev_esp8266_i2c_give_bus(void)
{
    if (g_ev_i2c_bus_mutex != NULL) {
        (void)xSemaphoreGive(g_ev_i2c_bus_mutex);
    }
}

static ev_i2c_status_t ev_esp8266_i2c_begin_locked(ev_esp8266_i2c_adapter_ctx_t *adapter, int64_t *out_started_us)
{
    int64_t started_us;
    ev_i2c_status_t status;

