wzurawski015/esp8266-event-driven-framework/adapters/esp8266_rtos_sdk/components/ev_platform/ev_i2c_adapter.c
    started_us = esp_timer_get_time();
    status = ev_esp8266_i2c_prepare_bus(ctx, started_us);
    ev_esp8266_i2c_release_bus_lines(ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);
    if ((status == EV_I2C_OK) && (!ev_esp8266_i2c_sample_sda(ctx) || !ev_esp8266_i2c_sample_scl(ctx))) {
        status = EV_I2C_ERR_BUS_LOCKED;
    }

    ev_esp8266_i2c_give_bus();
    if (status != EV_I2C_OK) {
        ++ctx->sleep_prepare_failures;
        (void)ev_esp8266_i2c_record_status(ctx, status);
        return EV_ERR_STATE;
    }

    return EV_OK;
}

ev_result_t ev_esp8266_i2c_port_init(ev_i2c_port_t *out_port, int sda_pin, int scl_pin)
{
    gpio_config_t sdk_cfg = {0};
    esp_err_t sdk_rc;
    ev_i2c_status_t bus_status;

    if ((out_port == NULL) || !ev_esp8266_i2c_pin_is_valid(sda_pin) || !ev_esp8266_i2c_pin_is_valid(scl_pin) ||
        (sda_pin == scl_pin)) {
        return EV_ERR_INVALID_ARG;
    }

    if (g_ev_i2c_bus_mutex == NULL) {
        /*
         * MISRA EXCEPTION: ESP8266 RTOS SDK lacks supported
         * configSUPPORT_STATIC_ALLOCATION for semaphore creation. Dynamic
         * allocation is permitted here ONLY during the boot-time hardware
         * initialization phase. The runtime I2C hot path remains zero-heap:
         * transactions use the already-created mutex and the bounded GPIO
         * software master, never SDK command links or allocator-backed
         * descriptors.
         */
        g_ev_i2c_bus_mutex = xSemaphoreCreateMutex();
        if (g_ev_i2c_bus_mutex == NULL) {
            ESP_LOGE(k_ev_i2c_tag, "bus mutex allocation failed");
            return EV_ERR_STATE;
        }
    }

    sdk_cfg.pin_bit_mask = (1ULL << (unsigned)sda_pin) | (1ULL << (unsigned)scl_pin);
    sdk_cfg.mode = GPIO_MODE_OUTPUT_OD;
    sdk_cfg.pull_up_en = GPIO_PULLUP_ENABLE;
    sdk_cfg.pull_down_en = GPIO_PULLDOWN_DISABLE;
    sdk_cfg.intr_type = GPIO_INTR_DISABLE;

    sdk_rc = gpio_config(&sdk_cfg);
    if (sdk_rc != ESP_OK) {
        ESP_LOGE(k_ev_i2c_tag, "gpio_config for zero-heap i2c failed rc=%d", (int)sdk_rc);
        return EV_ERR_STATE;
    }

    g_ev_i2c0_ctx.port_num = EV_I2C_PORT_NUM_0;
    g_ev_i2c0_ctx.sda_pin = sda_pin;
    g_ev_i2c0_ctx.scl_pin = scl_pin;
    g_ev_i2c0_ctx.configured = true;
    ev_esp8266_i2c_reset_diag(&g_ev_i2c0_ctx);

    ev_esp8266_i2c_release_bus_lines(&g_ev_i2c0_ctx);
    ets_delay_us(EV_ESP8266_I2C_HALF_PERIOD_US);

    bus_status = ev_esp8266_i2c_prepare_bus(&g_ev_i2c0_ctx, esp_timer_get_time());
    if (bus_status != EV_I2C_OK) {
        ESP_LOGE(k_ev_i2c_tag, "zero-heap i2c bus is not idle after init status=%d", (int)bus_status);
        g_ev_i2c0_ctx.configured = false;
        return EV_ERR_STATE;
    }

    out_port->ctx = &g_ev_i2c0_ctx;
    out_port->write_stream = ev_esp8266_i2c_write_stream;
    out_port->read_stream = ev_esp8266_i2c_read_stream;
    out_port->write_regs = ev_esp8266_i2c_write_regs;
    out_port->read_regs = ev_esp8266_i2c_read_regs;

    return EV_OK;
}
